import matplotlib.pyplot as plt

fig = plt.figure(figsize=(15, 20))

threads = ['1','4','8','16','32','64']
data_size = ['40','120','400','2000','4000','10000','20000']

axes = fig.add_subplot(projection='3d')
x = [0,10,20,30,40,50]
y = [0,0,0,0,0,0]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.000009, 0.000011, 0.000022, 0.000079, 0.000291, 0.002062]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [10,10,10,10,10,10]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.000058, 0.000040, 0.000069, 0.000132, 0.000307, 0.001960]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [20,20,20,20,20,20]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.000623, 0.000237, 0.000297, 0.000284, 0.000372, 0.001642]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [30,30,30,30,30,30]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.015659, 0.004425, 0.005191, 0.003303, 0.002774, 0.003848]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [40,40,40,40,40,40]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.063031, 0.024110, 0.012988, 0.012298, 0.009800, 0.012367]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [50,50,50,50,50,50]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.392101, 0.116007, 0.078194, 0.076301, 0.063658, 0.067495]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [60,60,60,60,60,60]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [1.627662, 0.116007, 0.228573, 0.192419, 0.193400, 0.253308]
axes.bar3d(x,y,z,dx,dy,dz)

axes.set_xlabel('Количество нитей', fontsize=13)
axes.set_ylabel('Размер данных', fontsize=13)
axes.set_zlabel('Время выполнения в секундах', fontsize=13)
axes.set_xticks([0,10,20,30,40,50], threads, fontsize=13)
axes.set_yticks([0,10,20,30,40,50,60], data_size, fontsize=13)
axes.set_title('Зависимость времени выполнения для OpenMP от конфигурации запуска', fontsize=14)
axes.grid(False)
axes.view_init(20, -70)

plt.savefig('omp_plot.png')
plt.show()