import matplotlib.pyplot as plt

fig = plt.figure(figsize=(15, 25))

threads = ['1','4','8','16','32','48']
data_size = ['40','120','400','2000','4000','10000','20000']

axes = fig.add_subplot(projection='3d')
x = [0,10,20,30,40,50]
y = [0,0,0,0,0,0]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.000139, 0.000393, 0.000518, 0.001515, 0.001140, 0.001590]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [10,10,10,10,10,10]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.001381, 0.001058, 0.001158, 0.001346, 0.001935, 0.002612]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [20,20,20,20,20,20]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.004596, 0.001914, 0.002335, 0.002642, 0.003565, 0.003441]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [30,30,30,30,30,30]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.096812, 0.028520, 0.030531, 0.020081, 0.018153, 0.017048]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [40,40,40,40,40,40]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [0.376207, 0.128214, 0.111806, 0.067433, 0.064578, 0.046740]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [50,50,50,50,50,50]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [2.339288, 0.601240, 0.386254, 0.240124, 0.325905, 0.242333]
axes.bar3d(x,y,z,dx,dy,dz)

x = [0,10,20,30,40,50]
y = [60,60,60,60,60,60]
z = [0,0,0,0,0,0]
dx = [4,4,4,4,4,4]
dy = [4,4,4,4,4,4]
dz = [9.310144, 2.421311, 1.255149, 0.733342, 0.561925, 0.607289]
axes.bar3d(x,y,z,dx,dy,dz)

axes.set_xlabel('Количество нитей', fontsize=14)
axes.set_ylabel('Размер данных', fontsize=14)
axes.set_zlabel('Время выполнения в секундах', fontsize=15)
axes.set_xticks([0,10,20,30,40,50], threads, fontsize=12)
axes.set_yticks([0,10,20,30,40,50,60], data_size, fontsize=12)
axes.set_title('Зависимость времени выполнения для MPI от конфигурации запуска', fontsize=15)
axes.grid(False)
axes.view_init(20, -70)

plt.savefig('mpi_plot.png')
plt.show()
